buoyantPimpleFoam-shuikuijisuan/test/average/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    inlet
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    outletwater
    {
         type            fixedFluxPressure;
        value           uniform 1e5;
    }

    outlet
    {
        type            prghPressure;
        p               uniform 1e5;
        value           uniform 1e5;
    }
}

// ************************************************************************* //
