buoyantPimpleFoam-shuikuijisuan/test/average/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial; 
    thermo          hPolynomial;
    equationOfState icoPolynomial;
    specie          specie;
    energy          sensibleInternalEnergy; 
}

pRef            100000;

mixture
{
    specie
    {
        nMoles          1;
        molWeight       18;
    }
    equationOfState
    {
      
        rhoCoeffs<8> (627.7715988 2.7305607 -0.0050041 0 0 0 0 0); //密度
    }
    thermodynamics
    {
        CpCoeffs<8>  (4443.85404 -0.88971 0 0 0 0 0 0) ;//等压比热容
        Hf          0;  //生成焓
        Sf          0;
    }
    transport
    {
        muCoeffs<8>        (0.00775 -0.000023 0 0 0 0 0 0);//粘度
        kappaCoeffs<8>     (-0.028299706 0.002135294 0 0 0 0 0 0);//热导率
    }
}


// ************************************************************************* //
