buoyantPimpleFoam-shuikuijisuan/test/average/system/Avg
Avg
    {
    type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                base        time;
            }

        );
    }